#**Trabalhando com Planilhas do Excel**

In [4]:
#Instalação, caso necessário
!pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.0.10-py2.py3-none-any.whl (242 kB)
     -------------------------------------- 242.1/242.1 kB 2.9 MB/s eta 0:00:00
Collecting et-xmlfile
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.0.10

In [1]:
#Importando a biblioteca
import pandas as pd

In [5]:
#Leitura dos arquivos
# df1 = pd.read_excel("Aracaju.xlsx")
# df2 = pd.read_excel("Fortaleza.xlsx")
# df3 = pd.read_excel("Natal.xlsx")
# df4 = pd.read_excel("Recife.xlsx")
# df5 = pd.read_excel("Salvador.xlsx")

df1 = pd.read_excel("SEU_PATH_AQUI") #Caso esteja utilizando uma IDE local
df2 = pd.read_excel("SEU_PATH_AQUI")
df3 = pd.read_excel("SEU_PATH_AQUI")
df4 = pd.read_excel("SEU_PATH_AQUI")
df5 = pd.read_excel("SEU_PATH_AQUI")

In [13]:
df5.head()

     Cidade       Data  Vendas  LojaID  Qtde
0  Salvador 2018-01-01   31.06    1037     3
1  Salvador 2018-01-01   19.02    1034     3
2  Salvador 2019-02-10  173.59    1035     3
3  Salvador 2019-02-10  176.34    1037     3
4  Salvador 2019-02-14   19.47    1037     3

In [14]:
#juntando todos os arquivos
df = pd.concat([df1,df2,df3,df4,df5])

In [15]:
#Exibindo as 5 primeiras linhas
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [16]:
#Exibindo as 5 últimas linhas
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [17]:
df.sample(5)

        Cidade       Data  Vendas  LojaID  Qtde
77     Aracaju 2018-01-01   24.10    1522     1
123      Natal 2019-01-02  127.45    1036     3
79   Fortaleza 2019-01-01   41.25    1005     6
6     Salvador 2019-01-01   36.30    1034     2
14      Recife 2019-01-12  102.91     982     3

In [18]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [19]:
#Alterando o tipo de dado da coluna LojaID
df["LojaID"] = df["LojaID"].astype("object")

In [20]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [24]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

**Tratando valores faltantes**

In [23]:
#Consultando linhas com valores faltantes
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [25]:
#Substituindo os valores nulos pela média
df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)

In [26]:
df["Vendas"].mean()

122.61180089485458

In [27]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [28]:
df.sample(15)

        Cidade       Data  Vendas LojaID  Qtde
124   Salvador 2019-03-02   44.82   1034     3
41       Natal 2018-05-20  835.00    852     4
139      Natal 2019-01-02  169.01   1036     1
74   Fortaleza 2019-01-01  163.09   1005     5
51     Aracaju 2018-01-01   40.58   1522     6
83     Aracaju 2018-01-01   14.44   1520     5
88   Fortaleza 2019-01-01   68.60   1004     6
154   Salvador 2019-01-02    9.58   1037     1
71    Salvador 2019-01-01   21.36   1035     2
1     Salvador 2018-01-01   19.02   1034     3
89      Recife 2019-01-01   18.11    980     3
131     Recife 2019-03-02  139.07    982     6
28      Recife 2019-01-01  123.69    983     3
24      Recife 2019-01-01   13.00    983     2
234      Natal 2019-01-03   48.39   1035     2

In [29]:
#Substituindo os valores nulos por zero
df["Vendas"].fillna(0, inplace=True)

In [30]:
#Apagando as linhas com valores nulos
df.dropna(inplace=True)

In [31]:
#Apagando as linhas com valores nulos com base apenas em 1 coluna
df.dropna(subset=["Vendas"], inplace=True)

In [32]:
#Removendo linhas que estejam com valores faltantes em todas as colunas
df.dropna(how="all", inplace=True)

**Criando colunas novas**

In [33]:
#Criando a coluna de receita
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [34]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [35]:
df["Receita/Vendas"] = df["Receita"] / df["Vendas"]

In [36]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08             8.0

In [38]:
#Retornando a maior receita
df["Receita"].max()

3544.0

In [39]:
#Retornando a menor receita
df["Receita"].min()

3.34

In [40]:
#nlargest
df.nlargest(3, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0

In [41]:
#nsamllest
df.nsmallest(3, "Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
118  Aracaju 2018-01-01    3.34   1522     1     3.34             1.0
65    Recife 2019-01-01    4.01    981     1     4.01             1.0
92     Natal 2019-01-02    4.57   1035     1     4.57             1.0

In [42]:
#Agrupamento por cidade
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [43]:
#Ordenando o conjunto de dados
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0
38  Natal 2018-02-25   828.0    852     4   3312.0             4.0
10  Natal 2018-10-27   828.0    852     4   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4   3112.0             4.0

#**Trabalhando com datas**

In [44]:
#Trasnformando a coluna de data em tipo inteiro
df["Data"] = df["Data"].astype("int64")

In [45]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade             object
Data                int64
Vendas            float64
LojaID             object
Qtde                int64
Receita           float64
Receita/Vendas    float64
dtype: object

In [46]:
#Transformando coluna de data em data
df["Data"] = pd.to_datetime(df["Data"])

In [47]:
df.dtypes

Cidade                    object
Data              datetime64[ns]
Vendas                   float64
LojaID                    object
Qtde                       int64
Receita                  float64
Receita/Vendas           float64
dtype: object

In [48]:
#Agrupamento por ano
df.groupby(df["Data"].dt.year)["Receita"].sum()

Data
2018    118176.53
2019    228246.45
Name: Receita, dtype: float64

In [49]:
#Criando uma nova coluna com o ano
df["Ano_Venda"] = df["Data"].dt.year

In [50]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda
72,Recife,2019-01-01,42.32,982,2,84.64,2.0,2019
141,Fortaleza,2019-03-02,182.75,983,8,1462.00,8.0,2019
75,Salvador,2019-01-01,155.52,1034,1,155.52,1.0,2019
209,Salvador,2019-01-02,69.98,1034,2,139.96,2.0,2019
100,Salvador,2019-01-01,190.97,1036,2,381.94,2.0,2019

In [51]:
#Extraindo o mês e o dia
df["mes_venda"], df["dia_venda"] = (df["Data"].dt.month, df["Data"].dt.day)

In [52]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda
182,Natal,2019-01-02,6.60,1037,2,13.20,2.0,2019,1,2
5,Aracaju,2018-01-01,156.20,1522,1,156.20,1.0,2018,1,1
130,Fortaleza,2019-03-02,12.36,983,4,49.44,4.0,2019,3,2
118,Salvador,2019-03-02,92.21,1035,2,184.42,2.0,2019,3,2
6,Aracaju,2018-01-01,35.50,1522,2,71.00,2.0,2018,1,1

In [53]:
#Retornando a data mais antiga
df["Data"].min()

Timestamp('2018-01-01 00:00:00')

In [54]:
#Retornando a data mais atual
df["Data"].max()

Timestamp('2019-04-05 00:00:00')

In [55]:
#Calculando a diferença de dias
df["diferenca_dias"] = df["Data"] - df["Data"].min()

In [56]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda,diferenca_dias
199,Salvador,2019-01-02,153.87,1036,3,461.61,3.0,2019,1,2,366 days
42,Natal,2019-03-02,775.00,854,2,1550.00,2.0,2019,3,2,425 days
36,Salvador,2019-01-01,9.67,1037,1,9.67,1.0,2019,1,1,365 days
13,Salvador,2019-02-12,39.29,1035,1,39.29,1.0,2019,2,12,407 days
42,Recife,2019-01-01,161.45,983,3,484.35,3.0,2019,1,1,365 days

In [57]:
#Criando a coluna de trimestre
df["trimestre_venda"] = df["Data"].dt.quarter

In [58]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda,diferenca_dias,trimestre_venda
43,Recife,2019-01-01,22.29,983,7,156.03,7.0,2019,1,1,365 days,1
35,Recife,2019-01-01,148.90,983,1,148.90,1.0,2019,1,1,365 days,1
203,Salvador,2019-01-02,37.75,1035,2,75.50,2.0,2019,1,2,366 days,1
216,Natal,2019-01-02,5.82,1035,1,5.82,1.0,2019,1,2,366 days,1
93,Aracaju,2018-01-01,188.70,1523,1,188.70,1.0,2018,1,1,0 days,1

In [59]:
#Filtrando as vendas de 2019 do mês de março
vendas_marco_19 = df.loc[(df["Data"].dt.year == 2019) & (df["Data"].dt.month == 3)]

In [60]:
vendas_marco_19.sample(20)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda,diferenca_dias,trimestre_venda
129,Salvador,2019-03-02,125.66,1037,1,125.66,1.0,2019,3,2,425 days,1
120,Salvador,2019-03-02,140.17,1036,2,280.34,2.0,2019,3,2,425 days,1
113,Salvador,2019-03-02,18.90,1034,3,56.70,3.0,2019,3,2,425 days,1
126,Recife,2019-03-02,41.87,980,8,334.96,8.0,2019,3,2,425 days,1
118,Fortaleza,2019-03-02,17.70,981,5,88.50,5.0,2019,3,2,425 days,1
119,Salvador,2019-03-02,136.37,1034,2,272.74,2.0,2019,3,2,425 days,1
118,Recife,2019-03-02,17.70,981,5,88.50,5.0,2019,3,2,425 days,1
111,Salvador,2019-03-02,147.35,1037,2,294.70,2.0,2019,3,2,425 days,1
19,Natal,2019-03-31,282.00,854,2,564.00,2.0,2019,3,31,454 days,1
111,Recife,2019-03-02,8.00,981,3,24.00,3.0,2019,3,2,425 days,1
131,Recife,2019-03-02,139.07,982,6,834.42,6.0,2019,3,2,425 days,1
108,Salvador,2019-03-02,11.72,1037,1,11.72,1.0,2019,3,2,425 days,1
45,Natal,2019-03-11,431.00,852,3,1293.00,3.0,2019,3,11,434 days,1
50,Natal,2019-03-08,324.00,854,4,1296.00,4.0,2019,3,8,431 days,1
120,Fortaleza,2019-03-02,184.90,982,4,739.60,4.0,2019,3,2,425 days,1
125,Fortaleza,2019-03-02,37.60,983,4,150.40,4.0,2019,3,2,425 days,1
124,Fortaleza,2019-03-02,47.98,983,7,335.86,7.0,2019,3,2,425 days,1
116,Salvador,2019-03-02,41.78,1034,3,125.34,3.0,2019,3,2,425 days,1
141,Fortaleza,2019-03-02,182.75,983,8,1462.00,8.0,2019,3,2,425 days,1
124,Recife,2019-03-02,47.98,983,7,335.86,7.0,2019,3,2,425 days,1

In [66]:
vendas_marco_19.count()

Cidade             121
Data               121
Vendas             121
LojaID             121
Qtde               121
Receita            121
Receita/Vendas     121
Ano_Venda          121
mes_venda          121
dia_venda          121
diferenca_dias     121
trimestre_venda    121
dtype: int64